start_message = 'Добро пожалывать.'

category_select = 'Выберите категорию'

faq = (
    'Заявки на замену не принимаются, если:\n'
    '1. Прошло более 20 минут с момента покупки.\n'
    '2. Аккаунты были использованы в работе, которая могла повлечь бан или спамблок (инвайтинг,спам и т.д)'
)

partners = 'В данный момент нет партнеров, зайдите позже.'

no_product = 'В данный момент такого товара нет.'

choose_product = 'Выберите товар.'

product_info_v1 = 'Название: {:s}\n\nЦена: {:.2f}\nКоличество: {:d}\n\nОписание: {:s}'

product_info_v2 = 'Название: {:s}\n\nЦена: {:.2f}\n\nОписание: {:s}'

enter_quantity = 'Введите количество товара.'

input_error = (
    'Вы ввели что то невнятное... '
    'Попробуйте ввести число.'
)

not_enough = 'Не достаточно товара.'

minimum_input = 'Минимальное количество товара: 1'

order = (
    'Номер вашего заказа: N{:d}\n\n'
    '--Тип: "{:s}"\n'
    '--Количество: {:d} шт.\n'
    '--Цена: {:.2f} руб./шт\n\n'
    'Итого: {:.2f} руб.'
)

hello_admin = 'Добро пожаловать в админ панель'

category_not_found = 'Категория не найдена.'

product_information = 'Введите информацию о товаре: Название, Цена, Описание.'

price_entry_error = 'Вводите цену только цифрами.'

err_args = 'Вы не указали несколько аргументов.'

add_photo = 'Отправьте картинку или пропустите шаг.'

add_zip_file = 'Отправьте zip файл.'

file_not_valid = 'Файл не имеет тип zip. Отправляйте только zip файлы.'

product_added = 'Товар "{:s}" добавлен.'

order_expired = 'Срок действия заказа N{:d} истек.'

back = 'Выберите действие'

message = (
    'Всем привет, меня зовут Андрей ☺️\n\n\n'
    'Я представляю компанию Path dream у нас большой спектр услуг в продвижении ❗️\n\n'
    'И я знаю, как найти твою целевую аудиторию с минимальными вложениями.\n'
    'Опыт работы более 5 лет.\n\n'
    'Познакомиться со мной можно по ссылке 👇\n'
    'https://t.me/marketingdream'
)
